//
//#include <stdio.h>
//
//int main(void) {
//	int i;
//	double f;
//	f = 5 /4;
//	// f에1.0 이저장
//	
//	printf("%f\n", f);
//
//	f = (double)5 / 4;
//	// 형변환연산자가우선순위가높으므로
//	// 5.0/4로실행됨.
//
//	printf("%f\n", f);
//
//	f = 5.0 / 4;
//	// 피연산자중하나가doubl형이므로
//	// 5.0 / 4.0으로실행
//
//	printf("%f\n", f);
//	
//
//	f = (double)5 / (double)4;
//	// 5.0/4.0으로계산
//	printf("%f\n", f);
//	
//	i = 1.3 + 1.8;
//	// 두결과는3.1이나 i가정수형이므로3 저장
//	printf("%d\n", i);
//	
//	i = (int)1.3 + (int)1.8;
//	// 명시적형변환으로1 + 1로변환함으로 2가 저장
//	printf("%d\n", i);
//
//	return 0;
//}
